jimmywong2003/nrf52811-ble-long-range-demo/ble_app_uart/main.c
#ifdef NRF52840_XXAA
#define TX_POWER_LEVEL (8) /**< TX Power Level value. This will be set both in the TX Power service, in the advertising data, and also used to set the radio transmit power. */
#else
#define TX_POWER_LEVEL (4) /**< TX Power Level value. This will be set both in the TX Power service, in the advertising data, and also used to set the radio transmit power. */
#endif

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
//BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

static uint16_t m_conn_handle          = BLE_CONN_HANDLE_INVALID;                   /**< Handle of the current connection. */
static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;              /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
        {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

#define COMPANY_IDENTIFIER              0x0059                                        /**< Company identifier for Nordic Semiconductor ASA as per www.bluetooth.org. */

#define ADV_ENCODED_AD_TYPE_LEN         1                                             /**< Length of encoded ad type in advertisement data. */
#define ADV_ENCODED_AD_TYPE_LEN_LEN     1                                             /**< Length of the 'length field' of each ad type in advertisement data. */
#define ADV_FLAGS_LEN                   1                                             /**< Length of flags field that will be placed in advertisement data. */
#define ADV_ENCODED_FLAGS_LEN           (ADV_ENCODED_AD_TYPE_LEN +       \
                                         ADV_ENCODED_AD_TYPE_LEN_LEN +   \
                                         ADV_FLAGS_LEN)                              /**< Length of flags field in advertisement packet. (1 byte for encoded ad type plus 1 byte for length of flags plus the length of the flags itself). */

#define ADV_ENCODED_COMPANY_ID_LEN      2                                            /**< Length of the encoded Company Identifier in the Manufacturer Specific Data part of the advertisement data. */

#define APP_ADVDATA_DEVICE_NAME         "DEVICE_00001"

#define APP_ADVDATA_DEVICE_NAME         0x44, 0x045, 0x56, 0x49, 0x43, 0x45, 0x5F, 0x030, 0x030, 0x030, 0x030, 0x031

#define APP_ADVDATA_MAC_ADDR    { 0xC0, 0x11, 0x22, 0x33, 0x44, 0xCC }

#define APP_ADVDATA_BATTERY_VALUE 0x64
#define APP_ADVDATA_TX_POWER      0x00
#define APP_ADVDATA_MANUFACTURER_OTHER_DATA 0x01, 0x02, 0x03, 0x04

#define APP_ADVDATA_DEVICE_NAME_LENGTH 0x0C
#define APP_ADVDATA_MAC_ADDR_LENGTH 0x06
#define APP_ADVDATA_BATTERY_LENGTH 0x01
#define APP_ADVDATA_TX_POWER_LENGTH 0x01
#define APP_ADVDATA_OTHER_LENGTH 0x06

#define ADV_ADDL_MANUF_DATA_LEN         (BLE_GAP_ADV_SET_DATA_SIZE_MAX -                \
                                         (                                     \
                                                 ADV_ENCODED_FLAGS_LEN +           \
                                                 (                                 \
                                                         ADV_ENCODED_AD_TYPE_LEN +     \
                                                         ADV_ENCODED_AD_TYPE_LEN_LEN + \
                                                         ADV_ENCODED_COMPANY_ID_LEN    \
                                                 )                                 \
                                         )                                     \
                                         )

/**< Value of the additional manufacturer specific data that will be placed in air (initialized to all zeros). */
static uint8_t m_addl_adv_manuf_data[ADV_ADDL_MANUF_DATA_LEN]  =
{
        APP_ADVDATA_DEVICE_NAME,                                 /* 6 bytes for Device ID */
        APP_ADVDATA_MAC_ADDR,                                  /* 6 bytes for BLE MAC Address */
        APP_ADVDATA_BATTERY_VALUE,                             /* 1 byte for battery value in % */
        APP_ADVDATA_TX_POWER,                                /* 1 byte for the measure RSSI value */
        APP_ADVDATA_MANUFACTURER_OTHER_DATA,                                /* 8 bytes for other data*/
};

static bool m_advertising_is_running = false;


static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;           /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];            /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_srp_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];           /**< Buffer for storing an encoded scan data. */

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
        .adv_data =
        {
                .p_data = m_enc_advdata,
                .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX
        },
        .scan_rsp_data =
        {
                .p_data = m_enc_srp_data,
                .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX

        }
};

static void advertising_start(void);

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
        app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);
}

